/*****************************************************************************
鳥のモデル表示[bird.h]
Aythor	: 上野　匠
Data	: 2017_01_15
=============================================================================
Updata

*****************************************************************************/
#ifndef BIRD_H
#define BIRD_H

//////////////////////////////////////////////////////////////////////////////
//ヘッダーファイルインクルード
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
//定数定義
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
//構造体定義
//////////////////////////////////////////////////////////////////////////////
typedef	enum
{
	BIRD_TYPE_000 = 0,			//浮いてるカモメ
	BIRD_TYPE_001,				//飛んでるカモメ
	BIRD_TYPE_MAX,				//モデル種類の最大数
	BIRD_TYPE_NULL
}BIRD_TYPE;

typedef struct
{
	D3DXVECTOR3		pos;		//座標
	D3DXVECTOR3		angle;		//角度
	D3DXVECTOR3		size;		//サイズ
	D3DXVECTOR3		moveVec;	//進行方向
	float			move;		//進行速度
	bool			use;		//使用フラグ
	BIRD_TYPE		type;		//モデルの種類
	int				collisionID;//コリジョンのID
}BIRD;

//////////////////////////////////////////////////////////////////////////////
//プロトタイプ宣言
//////////////////////////////////////////////////////////////////////////////
void	initBird	( void );
void	uninitBird	( void );
void	updateBird	( void );
void	drawBird	( void );
BIRD	*getBird	( int num );
void	setBird		( D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 angle, D3DXVECTOR3 moveVec, float move, BIRD_TYPE type);
void	releaseBird	( int num );

#endif