/*****************************************************************************
ゲームモード
Aythor	: 上野　匠
Data	: 2016_12_23
=============================================================================
Updata

*****************************************************************************/
#ifndef	GAME_H
#define	GAME_H
//////////////////////////////////////////////////////////////////////////////
//定数定義
//////////////////////////////////////////////////////////////////////////////
#define	FIELD_X		(3)
#define	FIELD_Y		(3)

//////////////////////////////////////////////////////////////////////////////
//構造体定義
//////////////////////////////////////////////////////////////////////////////
typedef enum
{
	DOME_ID_000 = 0,	//Skyドーム
	DOME_ID_MAX,		//ドーム総数
	DOME_ID_NULL		//null
}DOME_ID;

typedef enum
{
	FIELD_ID_00_01 = 0,	//海面1
	FIELD_ID_00_02,		//海面2
	FIELD_ID_00_03,
	FIELD_ID_00_04,
	FIELD_ID_00_05,
	FIELD_ID_00_06,
	FIELD_ID_00_07,
	FIELD_ID_00_08,
	FIELD_ID_00_09,
	FIELD_ID_01_01,
	FIELD_ID_01_02,
	FIELD_ID_01_03,
	FIELD_ID_01_04,
	FIELD_ID_01_05,
	FIELD_ID_01_06,
	FIELD_ID_01_07,
	FIELD_ID_01_08,
	FIELD_ID_01_09,
	FIELD_ID_MAX,		//フィールド総数
	FIELD_ID_NULL		//null
}FIELD_ID;

//////////////////////////////////////////////////////////////////////////////
//プロトタイプ宣言
//////////////////////////////////////////////////////////////////////////////
HRESULT	initGame	( void );
void	uninitGame	( void );
void	updateGame	( void );
void	drawGame	( void );

#endif