/*****************************************************************************
メッシュウォール描画
Aythor	: 上野　匠
Data	: 2016_12_10
=============================================================================
Updata

*****************************************************************************/
#ifndef	MESH_WALL_H
#define	MESH_WALL_H

//////////////////////////////////////////////////////////////////////////////
//定数定義
//////////////////////////////////////////////////////////////////////////////
#define	MAX_WALL	(256)		//フィールドの最大数

//////////////////////////////////////////////////////////////////////////////
//構造体定義
//////////////////////////////////////////////////////////////////////////////
typedef	enum
{
	WALL_TEX_000	=	0,	//煉瓦テクスチャ1
	WALL_TEX_MAX,			//テクスチャ総数
	WALL_TEX_NULL,			//null
}WALL_TEX;

typedef	struct
{
	D3DXVECTOR3	pos;		//表示座標
	D3DXVECTOR3	size;		//ポリゴンの幅高さ
	D3DXVECTOR3	numTyle;	//縦横何タイルか
	D3DXVECTOR3	rot;		//ポリゴンの回転量
	WALL_TEX	tex;		//テクスチャの種類
	bool		use;		//使用フラグ
}WALL;
//////////////////////////////////////////////////////////////////////////////
//プロトタイプ宣言
//////////////////////////////////////////////////////////////////////////////
HRESULT initMeshWall		( void );
void	setMeshWall			( D3DXVECTOR3 pos, D3DXVECTOR3 size, D3DXVECTOR3 numTyle, D3DXVECTOR3 rot, WALL_TEX tex );
D3DXVECTOR3	getWallPos		( int num );
void	uninitMeshWall		( void );
void	updateMeshWall		( void );
void	drawMeshWall		( void );

#endif